Repository: dalibor91/dos2unix
Catalog: dos2unix/po/dos2unix/*-x.po
Languages: eo

source: dos2unix %s (%s) Usage: dos2unix [options] [file ...] [-n infile outfile ...] -ascii convert only line breaks (default) -iso conversion between DOS and ISO-8859-1 character set -1252 Use Windows code page 1252 (Western European) -437 Use DOS code page 437 (US) (default) -850 Use DOS code page 850 (Western European) -860 Use DOS code page 860 (Portuguese) -863 Use DOS code page 863 (French Canadian) -865 Use DOS code page 865 (Nordic) -7 Convert 8 bit characters to 7 bit space -c --convmode conversion mode convmode ascii, 7bit, iso, mac, default to ascii -f --force force conversion of all files -h --help give this help -k --keepdate keep output file date -L --license display software license -l --newline add additional newline -n --newfile write to new file infile original file in new file mode outfile output file in new file mode -o --oldfile write to old file file ... files to convert in old file mode -q --quiet quiet mode, suppress all warnings always on in stdio mode -V --version display version number
eo: dos2unix %s (%s) Uzado: dos2unix [elektojn] [dosiero ...] [-n antauxajxo kreajxo ...] -ascii nur traduku linio-finojn (jam ensxaltita) -iso traduku inter DOS kaj ISO-8859-1 literaro -1252 Uzu Vindozan kodpagxon 1252 (Okcident-Euxropa) -437 Uzu DOS kodpagxon 437 (Usona) (jam ensxaltita) -850 Uzu DOS kodpagxon 850 (Okcident-Euxropa) -860 Uzu DOS kodpagxon 860 (Portugala) -863 Uzu DOS kodpagxon 863 (Kebekia) -865 Uzu DOS kodpagxon 865 (Nordlandaj) -7 Traduku de 8-bitaj literoj en blankspacon -c --convmode modo de sxangxo sxangxmodo ascii, 7bit, iso, mac, provizore elektita ascii -f --force forte sxangxi cxiujn dosierojn senhalte -h --help diri cxi tiun mesagxon -k --keepdate konservi dato-tempon dosieran -L --license eldiru permesilon tekstan -l --newline aldoni markon linian finan -n --newfile registri novan dosieron antauxajxo al antauxa dosiero metita novmoden kreajxo al dosiero registrita novmoden -o --oldfile registri malnovan dosieron dosiero... dosiero(j)n por registri per malnova modo -q --quiet silente eviti avertojn cxiam ensxaltata dum stdio modo -V --version diri eldono-numeron

source: With native language support.
eo: Uzante denaskan lingvon sistemon.

source: dos2unix: using code page %d.
eo: dos2unix: uzante kodpagxon %d.

source: dos2unix: can not write to output file
eo: dos2unix: ne povas registri dosieren

source: dos2unix: program error, invalid conversion mode %d
eo: dos2unix: programa eraro, negxustan sxangxmodon %d

source: dos2unix: Failed to open temporary output file
eo: dos2unix: malsukcesis malfermi provizoran dosieron registran

source: dos2unix: using %s as temporary file
eo: dos2unix: uzante %s kiel provizora dosiero

source: dos2unix: problems renaming '%s' to '%s'
eo: dos2unix: problemojn trovitajn renomigi '%s' al '%s'

source: output file remains in '%s'
eo: kreatan dosieron restas en '%s'

source: dos2unix: error: Value of environment variable DOS2UNIX_LOCALEDIR is too long.
eo: dos2unix: eraro: DOS2UNIX_LOCALEDIR tro longigxis.

source: dos2unix: active code page: %d
eo: dos2unix: nuntempa kodpagxo: %d

source: dos2unix: invalid %s conversion mode specified
eo: dos2unix: neuzebla %s sxangxmodo menciita

source: dos2unix: option '%s' requires an argument
eo: dos2unix: elekto '%s' bezonas elekto-vorton

source: dos2unix: target of file %s not specified in new file mode
eo: dos2unix: ejon de dosiero %s ne menciita en novmodo dosiera

source: dos2unix: Skipping %s, not a regular file.
eo: dos2unix: Pasante %s, dosiero ne taugxa.

source: dos2unix: Skipping binary file %s
eo: dos2unix: Pasante ne-tekstan dosieron %s

source: dos2unix: code page %d is not supported.
eo: dos2unix: kodpagxo %d ne estas konvertebla.

source: dos2unix: converting file %s to file %s in Unix format ...
eo: dos2unix: sxangxante dosieron %s al dosiero %s Unix-en ...

source: dos2unix: problems converting file %s to file %s
eo: dos2unix: problemojn trovitajn dum sxangxi dosiero %s al dosiero %s

source: dos2unix: converting file %s to Unix format ...
eo: dos2unix: sxangxante dosiero %s Unix-en ...

source: dos2unix: problems converting file %s
eo: dos2unix: problemojn dum sxangxi dosiero %s
