Repository: dalibor91/dos2unix
Catalog: dos2unix/po/unix2dos/*.po
Languages: eo

source: unix2dos %s (%s) Usage: unix2dos [options] [file ...] [-n infile outfile ...] -ascii convert only line breaks (default) -iso conversion between DOS and ISO-8859-1 character set -1252 Use Windows code page 1252 (Western European) -437 Use DOS code page 437 (US) (default) -850 Use DOS code page 850 (Western European) -860 Use DOS code page 860 (Portuguese) -863 Use DOS code page 863 (French Canadian) -865 Use DOS code page 865 (Nordic) -7 Convert 8 bit characters to 7 bit space -c, --convmode conversion mode convmode ascii, 7bit, iso, mac, default to ascii -f, --force force conversion of binary files -h, --help give this help -k, --keepdate keep output file date -L, --license display software license -l, --newline add additional newline -n, --newfile write to new file infile original file in new file mode outfile output file in new file mode -o, --oldfile write to old file file ... files to convert in old file mode -q, --quiet quiet mode, suppress all warnings always on in stdio mode -s, --safe skip binary files (default)
eo: unix2dos %s (%s) Uzado: unix2dos [elektojn] [dosiero ...] [-n antaŭaĵo kreaĵo ...] -ascii nur traduku linio-finojn (jam enŝaltita) -iso traduku inter DOS kaj ISO-8859-1 literaro -1252 Uzu Vindozan kodpaĝon 1252 (Okcident-Eŭropa) -437 Uzu DOS kodpaĝon 437 (Usona) (jam enŝaltita) -850 Uzu DOS kodpaĝon 850 (Okcident-Eŭropa) -860 Uzu DOS kodpaĝon 860 (Portugala) -863 Uzu DOS kodpaĝon 863 (Kebekia) -865 Uzu DOS kodpaĝon 865 (Nordlandaj) -7 Traduku de 8-bitaj literoj en blankspacon -c, --convmode modo de ŝanĝo ŝanĝmodo ascii, 7bit, iso, mac, provizore elektita ascii -f, --force force conversion of binary files -h, --help diri ĉi tiun mesaĝon -k, --keepdate konservi dato-tempon dosieran -L, --license eldiru permesilon tekstan -l, --newline aldoni markon linian finan -n, --newfile registri novan dosieron antaŭaĵo al antaŭa dosiero metita novmoden kreaĵo al dosiero registrita novmoden -o, --oldfile registri malnovan dosieron dosiero... dosiero(j)n por registri per malnova modo -q, --quiet silente eviti avertojn ĉiam enŝaltata dum stdio modo -s, --safe skip binary files (default)

source: -V, --version display version number
eo: -V, --version diri eldono-numeron

source: With native language support.
eo: Uzante denaskan lingvo-sistemon.

source: unix2dos: using code page %d.
eo: unix2dos: uzante kodpaĝon %d.

source: unix2dos: can not write to output file
eo: unix2dos: ne povas registri dosieren

source: unix2dos: program error, invalid conversion mode %d
eo: unix2dos: programa eraro, neĝustan ŝanĝmodon %d

source: unix2dos: Failed to open temporary output file
eo: unix2dos: malsukcesis malfermi provizoran dosieron registran

source: unix2dos: using %s as temporary file
eo: unix2dos: uzante %s kiel provizora dosiero

source: output file remains in '%s'
eo: kreatan dosieron restas en '%s'

source: unix2dos: problems renaming '%s' to '%s': %s
eo: unix2dos: problemojn trovitajn renomigi '%s' al '%s': %s

source: unix2dos: error: Value of environment variable DOS2UNIX_LOCALEDIR is too long.
eo: unix2dos: eraro: DOS2UNIX_LOCALEDIR tro longiĝis.

source: unix2dos: active code page: %d
eo: unix2dos: nuntempa kodpaĝo: %d

source: unix2dos: invalid %s conversion mode specified
eo: unix2dos: neuzebla %s ŝanĝmodo menciita

source: unix2dos: option '%s' requires an argument
eo: unix2dos: elekto '%s' bezonas elekto-vorton

source: unix2dos: target of file %s not specified in new file mode
eo: unix2dos: ejon de dosiero %s ne menciita en novmodo dosiera

source: unix2dos: Skipping %s, not a regular file.
eo: unix2dos: Pasante %s, dosiero ne tauĝa.

source: unix2dos: Skipping binary file %s
eo: unix2dos: Pasante ne-tekstan dosieron %s

source: unix2dos: code page %d is not supported.
eo: unix2dos: kodpaĝo %d ne estas konvertebla.

source: unix2dos: converting file %s to file %s in Mac format ...
eo: unix2dos: ŝanĝante dosiero %s al dosiero %s Mac-en ...

source: unix2dos: converting file %s to file %s in DOS format ...
eo: unix2dos: ŝanĝante dosiero %s al dosiero %s DOS-en ...

source: unix2dos: problems converting file %s to file %s
eo: unix2dos: problemojn trovitajn dum ŝanĝi dosiero %s al dosiero %s

source: unix2dos: converting file %s to Mac format ...
eo: unix2dos: ŝanĝante dosiero %s Mac-en ...

source: unix2dos: converting file %s to DOS format ...
eo: unix2dos: ŝanĝante dosiero %s DOS-en ...

source: unix2dos: problems converting file %s
eo: unix2dos: problemojn dum ŝanĝi %s
